0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   uniform (1.0 0 0);

boundaryField
{
    cylinder
    {
        type            noSlip;
    }
    backside
    {
        type            empty;
    }
    inflow
    {
        type            inletOutlet;
        inletValue      uniform (1.0 0 0);
        value           uniform (1.0 0 0);
    }
    outflow
    {
        type            zeroGradient;
    }
    upflow
    {
        type            symmetry;
    }
    downflow
    {
        type            symmetry;
    }
    frontside
    {
        type            empty;
    }
}


// ************************************************************************* //
