0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];


internalField   uniform 101325;

boundaryField
{
    cylinder
    {
        type            zeroGradient;
    }
    backside
    {
        type            empty;
    }
    inflow
    {
        type            zeroGradient;
    }
    outflow
    {
        type            waveTransmissive;
        gamma           1.4;
        fieldInf        101325;
        lInf            2;
        value           uniform 101325;
    }
    upflow
    {
        type            symmetry;
    }
    downflow
    {
        type            symmetry;
    }
    frontside
    {
        type            empty;
    }
}


// ************************************************************************* //
