system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     	rhoEnergyFoam;

startFrom       	latestTime; //startTime;

startTime       	0;

stopAt          	endTime;

endTime         	1.0;

deltaT          	2e-9;

writeControl    	adjustableRunTime;

writeInterval   	1e-6; 

purgeWrite      	0;

writeFormat     	ascii;

writePrecision  	6;

writeCompression 	off;

timeFormat      	general;

timePrecision   	6;

runTimeModifiable 	true;

adjustTimeStep  	yes;

maxCo         		2.0; //0.8; //1.0;

maxDeltaT       	1.;

pressArtDiff    	false;   // Activate artificial diffusion on pressure terms
convArtDiff     	false;  // Activate artificial diffusion on convective terms

ducLevelPress       	0.00;
ducLevelConv        	0.05;

epsilon             	500;
minfty		    	8.642e-6;

kp                  	0.25;
ku                  	0.75;


functions
{
 
 //#include "fieldAverageDict"
 
 forceCoeffs
 {
 // rhoInf - reference density
 // CofR - Centre of rotation
 // dragDir - Direction of drag coefficient
 // liftDir - Direction of lift coefficient
 // pitchAxis - Pitching moment axis
 // magUinf - free stream velocity magnitude
 // lRef - reference length
 // Aref - reference area
 type forceCoeffs;
 functionObjectLibs ("libforces.so");
 patches (cylinder);
 rhoName rho;
 UName  U;
 pName  p;
 rhoInf 1.225;
 CofR (0 0 0);
 liftDir (0 1 0);
 dragDir (1 0 0);
 pitchAxis (0 0 1);
 magUInf 1.0;
 lRef 0.002; // cylinder max diameter
 Aref 0.000002; //projected area from cylinder
 outputControl timeStep;
 outputInterval 1;
 }

   
 writeduc
 {
        type 		writeObjects;
        libs 		( "libutilityFunctionObjects.so" );
        objects 	("ducSensor");
        writeControl 	outputTime;
        writeInterval   1e-6;
 }
 

}

// ************************************************************************* //
